In [1]:
%load_ext sql

In [2]:
%sql postgresql://student:student@127.0.0.1/sparkifydb

'Connected: student@sparkifydb'

In [3]:
%sql SELECT * FROM songplays LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
0 rows affected.

[]

In [4]:
%sql SELECT * FROM users LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(69, 'Anabelle', 'Simpson', 'F', 'free'),
 (32, 'Lily', 'Burns', 'F', 'free'),
 (75, 'Joseph', 'Gutierrez', 'M', 'free'),
 (92, 'Ryann', 'Smith', 'F', 'free'),
 (49, 'Chloe', 'Cuevas', 'F', 'free')]

In [5]:
%sql SELECT * FROM songs LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[('SOGEKSP12A58A78530', 'August Is Over', 'AR052WY1187FB55B1C', 2007, 194.35057),
 ('SOYRACV12A8C13C4D8', '24 Hours Of Loneliness', 'AR0S3YD1187B99967F', 1975, 127.65995),
 ('SOIDBNB12A58A7A72C', 'Keep Me Crying', 'ARNNRN31187B9AE7B7', 1976, 189.41342),
 ('SOEDXTY12A6D4FB0ED', 'Het Meisje Van Mijn Hart', 'ARZDP5D1187B9B4ECB', 1983, 279.03955),
 ('SOXTCXD12AB0183E39', 'Silent Night', 'ARFL99B1187B9A2A45', 2009, 202.26567)]

In [6]:
%sql SELECT * FROM artists LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[('AR052WY1187FB55B1C', 'We The Kings', 'BRADENTON. FL', 27.4955, -82.57807),
 ('AR0S3YD1187B99967F', 'The Classics IV', 'Jacksonville, FL', None, None),
 ('ARNNRN31187B9AE7B7', 'Al Green', 'Forrest City, AR', None, None),
 ('ARZDP5D1187B9B4ECB', 'Arbeid Adelt!', 'Brussel 1981', 50.84838, 4.34968),
 ('ARFL99B1187B9A2A45', 'Sugarland', 'PERTH AMBOY, New Jersey', None, None)]

In [7]:
%sql SELECT * FROM time LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(1541903637, 2, 11, 45, 11, 2018, 7),
 (1541903771, 2, 11, 45, 11, 2018, 7),
 (1541904035, 2, 11, 45, 11, 2018, 7),
 (1541910974, 4, 11, 45, 11, 2018, 7),
 (1541911007, 4, 11, 45, 11, 2018, 7)]

## REMEMBER: Restart this notebook to close connection to `sparkifydb`
Each time you run the cells above, remember to restart this notebook to close the connection to your database. Otherwise, you won't be able to run your code in `create_tables.py`, `etl.py`, or `etl.ipynb` files since you can't make multiple connections to the same database (in this case, sparkifydb).